Phase 3/PEB/importFileAPIPayload.txt

<soapenv:Envelope xmlns:orac="http://xmlns.oracle.com/cpqcloud/commerce/oraclecpqo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-8269C7EE5556D8FDD417228699562276">
            <wsse:Username>superuser</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">d2y_S9!C72</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">hFFySSuueWCRtT278uFoNw==</wsse:Nonce>
            <wsu:Created>2024-08-05T14:59:16.227Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <bm:importFileAttachments xmlns:bm="http://xmlns.oracle.com/cpqcloud/commerce/oraclecpqo" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <bm:mode>update</bm:mode>
         <bm:attachments>
            <bm:attachment>
               <bm:document_number>1</bm:document_number>
               <bm:variable_name>pOCFileAttachment_c</bm:variable_name>
               <bm:filename>PEB Building Area.csv</bm:filename>
               <bm:file_content>"QmxkZy4gTm8uLFdpZHRoIChtKSxMZW4uIChtKSxFLiBILiAobSksUm9vZiBTbG9wZSxSb29mIEFyZWEgKG2yKSxBcmVhIE5vLFNub3coS04gL22yKSxGcmFtZSBUeXBlLExpdmUgTG9hZChLTi9tsiksQ29sbGF0ZXJhbChLTi9tMiksV2luZCBTcGVlZChrbS9IKSxObyBvZiBNYWluIEZyYW1lcyxObyBvZiBQb3N0ICYgQmVhbSxUb3RhbCBXZWlnaHQgKEtnKSxGYWN0b3J5LFdlaWdodCAoS2cvbbIpLEN1cnJlbmN5LERpc2NvdW50ICUsUHJpbWFyeSAobbIpLFRvdGFsIEJvb2sgUHJpY2UsU2Vjb25kYXJ5IChtsiksQm9vayBQcmljZSBwZXIgbbIsQm9vayBQcmljZSBwZXIgdG9uLERlc3RpbmF0aW9uLERpc2NvdW50ZWQgUHJpY2UsU2hpcHBpbmcgTWV0aG9kLERpc2NvdW50ZWQgUHJpY2UgcGVyIE0yLERpc2NvdW50ZWQgUHJpY2UgcGVyIHRvbixUcnVjayBwcmljZShFYWNoKSwiUHJpY2UgQm9vaywiDQoxMCwyMCwzMCw0MCw1MCw2MCw3MCw4MCw5MCwxMDAsMTEwLDEyMCwxMzAsMTQwLDE1MCwxNjAsMTcwLDE4MCwxOTAsMjAwLDIxMCwyMjAsMjMwLDI0MCwyNTAsMjYwLDI3MCwyODAsMjkwLDMwMCwiMzEwLCINCg=="</bm:file_content>
            </bm:attachment>
            <bm:attachment>
               <bm:document_number>1</bm:document_number>
               <bm:variable_name>pEBStandardFields_c</bm:variable_name>
               <bm:filename>PEB Linear Meter Category.csv</bm:filename>
               <bm:file_content>"Q2F0ZWdvcnkoS2cvTE0pLEJ1aWx0IHVwKE0uVG9ucyksQnVpbHQgdXAoTWFuLUhycy8gTVQpLEJ1aWx0IHVwKE1hbi1IUlMpLENyYW5lIEJlYW0oTS5Ub25zKSwiSG90IFJvbGxlZChNLlRvbnMpLCINCjEwLDIwLDMwLDQwLDUwLCI2MCwiDQo3MCw4MCw5MCwxMDAsMTEwLCIxMjAsIg0K"</bm:file_content>
            </bm:attachment>
         </bm:attachments>
         <bm:transaction>
            <bm:process_var_name>oraclecpqo</bm:process_var_name>
            <bm:id>201103174</bm:id>
         </bm:transaction>
      </bm:importFileAttachments>
   </soapenv:Body>
</soapenv:Envelope>